# Trabalhando com Planilhas do

Excel

In [1]:
#Importando a biblioteca
import pandas as pd

In [17]:
#Leitura dos arquivos
df1 = pd.read_excel("datasets/Aracaju.xlsx")
df2 = pd.read_excel("datasets/Fortaleza.xlsx")
df3 = pd.read_excel("datasets/Natal.xlsx")
df4 = pd.read_excel("datasets/Recife.xlsx")
df5 = pd.read_excel("datasets/Salvador.xlsx")

In [18]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [5]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [6]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [7]:
#Exibindo as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [22]:
df.sample(5)

        Cidade       Data  Vendas LojaID  Qtde
182      Natal 2019-01-02    6.60   1037     2
20    Salvador 2019-01-01   33.97   1034     3
148   Salvador 2019-01-02   40.59   1037     3
97   Fortaleza 2019-01-01  139.70   1003     4
221   Salvador 2019-01-02  142.23   1035     2

In [21]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [20]:
#Alterando o tipo de dado da coluna LojaID
df["LojaID"] = df["LojaID"].astype("object")

In [11]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [12]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

**Tratando valores faltantes**

In [19]:
#Consultando linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [14]:
#Substituindo os valores nulos pela média
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [16]:
df["Vendas"].mean()

122.61180089485458

In [70]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [23]:
df.sample(15)

       Cidade       Data  Vendas LojaID  Qtde
64      Natal 2019-02-22  704.00    853     4
101    Recife 2019-01-01  172.55    983     7
227  Salvador 2019-01-02   14.70   1035     1
54   Salvador 2019-01-01   46.54   1037     3
2     Aracaju 2018-01-01   71.55   1520     1
208     Natal 2019-01-02   39.40   1036     3
145  Salvador 2019-01-02   84.62   1034     2
4    Salvador 2019-02-14   19.47   1037     3
62    Aracaju 2018-01-01   28.66   1520     3
23      Natal 2019-02-14  304.00    854     3
93      Natal 2019-01-02   15.58   1037     1
141     Natal 2019-01-02    9.08   1036     1
57     Recife 2019-01-01  201.41    980     3
130    Recife 2019-03-02   12.36    983     4
41     Recife 2019-02-13  157.78    981     4

In [24]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [ ]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [ ]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [ ]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

# Criando colunas novas

In [25]:
#Criando a coluna de receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [26]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [27]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [28]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [29]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [30]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [32]:
#nlargest
df.nlargest(3, "Vendas")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
40  Natal 2018-01-10   885.0    853     3   2655.0             3.0
24  Natal 2018-04-22   868.0    854     3   2604.0             3.0

In [33]:
#nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [37]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [38]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

# Trabalhando com datas

In [45]:
#Trasnformando a coluna de data em tipo inteiro
df["Data"] = df["Data"].astype("int64")

In [46]:
#Verificando o tipo de dado de cada coluna
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [47]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [48]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [49]:
#Agrupamento por ano
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [50]:
#Criando uma nova coluna com o ano
df["Ano_Venda"] = df["Data"].dt.year

In [53]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda
27,Fortaleza,2019-01-01,212.37,1003,6,1274.22,6.0,2019
11,Salvador,2019-01-01,30.62,1034,3,91.86,3.0,2019
59,Fortaleza,2019-01-01,6.31,1002,3,18.93,3.0,2019
91,Natal,2019-01-02,17.74,1035,1,17.74,1.0,2019
95,Aracaju,2018-01-01,127.43,1522,9,1146.87,9.0,2018

In [54]:
#Extraindo o mês e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [55]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda
132,Recife,2019-03-02,17.49,983,5,87.45,5.0,2019,3,2
35,Fortaleza,2019-01-01,133.97,1005,2,267.94,2.0,2019,1,1
18,Natal,2019-03-14,581.00,853,3,1743.00,3.0,2019,3,14
108,Aracaju,2018-01-01,31.94,1520,8,255.52,8.0,2018,1,1
82,Fortaleza,2019-01-01,14.03,1004,5,70.15,5.0,2019,1,1

In [56]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [57]:
#Calculando a diferença de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [58]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias
15,Fortaleza,2019-01-01,195.05,1002,2,390.10,2.0,2019,1,1,365 days
145,Salvador,2019-01-02,84.62,1034,2,169.24,2.0,2019,1,2,366 days
100,Aracaju,2018-01-01,180.57,1520,6,1083.42,6.0,2018,1,1,0 days
75,Salvador,2019-01-01,155.52,1034,1,155.52,1.0,2019,1,1,365 days
118,Natal,2019-01-02,92.21,1035,2,184.42,2.0,2019,1,2,366 days

In [59]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [65]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
207,Salvador,2019-01-02,46.70,1036,2,93.40,2.0,2019,1,2,366 days,1
215,Natal,2019-01-02,203.84,1036,1,203.84,1.0,2019,1,2,366 days,1
4,Salvador,2019-02-14,19.47,1037,3,58.41,3.0,2019,2,14,409 days,1
61,Recife,2019-01-01,127.85,982,7,894.95,7.0,2019,1,1,365 days,1
57,Salvador,2019-01-01,11.72,1035,1,11.72,1.0,2019,1,1,365 days,1

In [66]:
#Filtrando as vendas de 2019 do mês de março
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [75]:
vendas_marco_19.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
66,Natal,2019-03-24,559.00,853,2,1118.00,2.0,2019,3,24,447 days,1
129,Salvador,2019-03-02,125.66,1037,1,125.66,1.0,2019,3,2,425 days,1
126,Salvador,2019-03-02,41.69,1036,2,83.38,2.0,2019,3,2,425 days,1
114,Fortaleza,2019-03-02,16.82,983,4,67.28,4.0,2019,3,2,425 days,1
139,Recife,2019-03-02,141.16,980,7,988.12,7.0,2019,3,2,425 days,1